#include <iostream>
#include <math.h>

using namespace std;

int main(int argc, const char * argv[]) {
    string ones[9] = {"один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"};
    string tens[9] = {" десять ", " двадцать ", " тридцать ", " сорок ", " пятьдесят ", " шестьдесят ", " семьдесят ", " восемьдесят ", " девяносто "};
    string hundreds[9] = {"сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"};
    
    int n;
    
    cout << "Введите число: ";
    cin >> n;
    
    cout << hundreds[(n / 100) - 1] << tens[((n / 10) % 10) - 1] << ones[(n % 10) - 1];
    
    return 0;
}
